// https://www.acmicpc.net/problem/2448
// 별 찍기 - 11
// 골드 4
// 분할 정복, 재귀
// 231006

// ---------------------------------------
const fs = require("fs");
// ---------------------------------------
function makeStar(N) {
  let star = ["  *   ", " * *  ", "***** "];
  for (let n = 6; n <= N; n <<= 1) {
    star = [
      ...star.map((v) => " ".repeat(n >> 1) + v + " ".repeat(n >> 1)),
      ...star.map((v) => v.repeat(2)),
    ];
  }
  return star.join("\n");
}

// ---------------------------------------
const isTest = process.platform !== "linux";
const inputFilePaths = !isTest ? ["/dev/stdin"] : ["./input1.txt"];

for (let filePath of inputFilePaths) {
  if (isTest) console.log("==============", filePath);
  const inputString = fs.readFileSync(filePath).toString();
  const N = +inputString.trim();
  console.log(makeStar(N).trimEnd());
}

// ---------------------------------------
// N = 3
//   *   |
//  * *  |
// ***** |

// N = 6
//      *      |
//     * *     |
//    *****    |
//   *     *   |
//  * *   * *  |
// ***** *****|

// N = 12
//            *            |
//           * *           |
//          *****          |
//         *     *         |
//        * *   * *        |
//       ***** *****       |
//      *           *      |
//     * *         * *     |
//    *****       *****    |
//   *     *     *     *   |
//  * *   * *   * *   * *  |
// ***** ***** ***** *****|

// N = 24
//                        *                        |
//                       * *                       |
//                      *****                      |
//                     *     *                     |
//                    * *   * *                    |
//                   ***** *****                   |
//                  *           *                  |
//                 * *         * *                 |
//                *****       *****                |
//               *     *     *     *               |
//              * *   * *   * *   * *              |
//             ***** ***** ***** *****             |
//            *                       *            |
//           * *                     * *           |
//          *****                   *****          |
//         *     *                 *     *         |
//        * *   * *               * *   * *        |
//       ***** *****             ***** *****       |
//      *           *           *           *      |
//     * *         * *         * *         * *     |
//    *****       *****       *****       *****    |
//   *     *     *     *     *     *     *     *   |
//  * *   * *   * *   * *   * *   * *   * *   * *  |
// ***** ***** ***** ***** ***** ***** ***** *****|
